[
  {
    "title": "Islamic Finance Overview",
    "content": "Fincorp Credit Limited has developed and introduced Islamic products and services to meet customer needs, focusing on financial inclusion. The company adopted the Islamic microfinance business model in October 2022, supported by Sulh Consultancy Company (Shari'ah Supervisory Board). Their Islamic Finance products and services are built on Shari'ah principles, designed to drive financial growth while maintaining their values of Transparency, Integrity, and Professionalism. FCL's principal strategy is to maintain its position as the leading Microfinance Islamic institution in the region."
  },
  {
    "title": "Islamic Finance Principles",
    "content": "Fincorp Credit Limited adopts a customer-centric approach to achieve financial inclusion for citizens left out of the traditional financial ecosystem. The basic principles of Islamic finance are built upon the avoidance of Riba (interest/usury), Gharar (ambiguity and uncertainty present in contractual relationships), and the prohibition of impermissible businesses as stated in the Holy Quran.Key Principles:- Prohibition of Riba: Any stipulated additional amount over the principal in a loan transaction is prohibited- Risk Sharing: Capital providers and entrepreneurs share business risks in return for profit sharing- Prohibition of Speculation (Gharar): Discourages hoarding and prohibits extremely uncertain transactions- Sanctity of Contracts: Upholds contractual obligations and information disclosure- Asset-backed Financing: One of the most important characteristics of Islamic financingIslamic microfinance is available to all people regardless of religious affiliations, focusing on relationship management and Shari'ah compliant solutions."
  },
  {
    "title": "Asset Financing",
    "content": "At Fincorp, we see your assets as more than just possessions; we see them as gateways to financial empowerment. Our asset financing solutions are available to assist you in achieving your objectives, whether they involve expanding your business, remodelling your home, or buying new assets. This product is available to both salaried individuals and business clients.Features:- Tenure: 24 months- Up to 70% Financing of the Market ValueBenefits:- Competitive interest rates- Prompt response to applications- Fast and simple processRequired Documents:- Original National ID & KRA PIN- Latest 12 months' bank statements/Mpesa statement- Post-dated Cheque(s) for the duration of the loan- Proforma Invoice from the dealer/Sales agreement- Comprehensive Insurance (can be financed)"
  },
  {
    "title": "Import Duty Financing",
    "content": "We specialize in offering services for Import Duty Financing to support your global business operations. We understand the intricacies and challenges of import duties, and we're here to provide customised financial solutions that ensure a smooth and cost-effective import process. The service includes transit to the final destination, import duty, storage fees, demurrages (if any), clearance, forwarding, and other logistical expenditures.Required Documents:- Bill of lading- Jevic / Export Certificate- English/Japanese Logbook- Import Declaration Form- Invoice- KRA pin & ID Copy of the client"
  },
  {
    "title": "Logbook Loan",
    "content": "Fincorp is available to offer a hassle-free solution in times of monetary emergency. Our Logbook loans service is created to give you a dependable, effective, and secure option to get the money you require, helping you overcome life's unforeseen obstacles.Features:- Tenure: 24 months- Minimum Amount: Kes 100,000- Maximum amount: Kes 5,000,000Benefits:- Competitive interest rates- Prompt response to applications- Fast and simple processRequired Documents:- Original Vehicle logbook, Original PIN and ID- A passport-size photo- Latest 6 months' certified bank and Mpesa statements- Post-dated cheques for the duration of the loan- Valid Comprehensive Insurance (can be financed)"
  },
  {
    "title": "Okoa Biashara Loan",
    "content": "Entrepreneurs face different opportunities as well as emergencies. This requires a financial partner in sync with day-to-day realities, thus eliminating bureaucracies or rigorous procedures when offering such unique business solutions. Whether you're a budding startup or a seasoned entrepreneur, Fincorp is here to provide the financial support and expertise you need to turn your vision into reality. This product is available to both individuals and business clients.Features:- Tenure: 24 months- Minimum Amount: Kes 100,000- Maximum amount: Kes 25,000,000Benefits:- Competitive interest rates- Prompt response to applications- Fast and simple processSole proprietor/individuals Required Documents:- Original Vehicle logbook, Original PIN and ID- A passport-size photo- Latest 6 months' certified bank and Mpesa statements- Post-dated cheques for the duration of the loan- Business Licence- Business Records- Valid Comprehensive Insurance (can be financed)Limited Company Required Documents:- Copy of ID and PIN of directors- Directors coloured passport photos- Certificate of Registration- Articles and memorandum of association and CR 12- Company profile- Company PIN- Business License- Latest 6 months' certified bank and Mpesa statements- Board Resolution- Copies of contracts/invoices- Postdated cheques- Motor vehicle logbook"
  },
  {
    "title": "Mshahara Loan",
    "content": "At Fincorp Credit, we provide mshahara loans that give you the financial assistance you require at the precise moment you require it. Our salary loans are created to make it easier for you to get by between paychecks, achieve personal objectives, or take care of immediate financial requirements. The service is only available for salaried or employed individuals.Features:- Tenure: 24 months- Minimum Amount: Kes 100,000- Maximum amount: Kes 2,000,000Required Documents:- Copy of ID and PIN- A passport-size photo- Copy of appointment or confirmation letter- Latest three months' pay slips- Latest 6 months' certified bank and Mpesa statements- Post-dated cheques for the duration of the loan- Motor vehicle logbook- Comprehensive Insurance (can be financed)"
  },
  {
    "title": "Insurance Services",
    "content": "Fincorp Credit under its insurance agency has partnered with insurance companies to offer Fincorp clients convenience, competitive premiums and quick turn-around in claims processing, with the key products being the following:Insurance Premium Financing (IPF):At Fincorp Credit, we understand that safeguarding your financial future is paramount.Workers Injury Benefits Act (WIBA):At Fincorp Credit, our mission is to be your trusted partner in ensuring WIBA compliance and financial security for your business and your employees.Marine Insurance:Our Marine Insurance service is your lifeline to safeguarding your maritime assets, cargo, and peace of mind.Contractors' Plant and Machinery Insurance:Fincorp Credit understands that your heavy machines and equipment are the backbone of your construction company."
  },
  {
    "title": "Trade Finance Solutions",
    "content": "As Kenya's first Trade Financing Hub, Fincorp Credit has partnered with Commercial Banks, Micro-Finance Banks, and Trade Credit Insurance Agencies to provide a tailor-made/customized solution to support local, regional, and international trade for contractors, suppliers, importers, and exporters. Clients enjoy the following products and services at preferential rates, turn-around time, and flexible collateral requirements."
  },
  {
    "title": "Bid Bonds",
    "content": "At Fincorp Credit, we understand time is of the essence in the world of business. Therefore, we are pleased to offer our unique Unsecured Bid Bond services, which may provide our clients with the financial backing you want in less than an hour. Your business projects may advance at the speed of your objectives with our bid bonds, without the burden of collateral.Why Choose Us:- Fast Approvals: Your Unsecured Bid Bond will be approved in just an hour thanks to our innovative technology and expert team- No Collateral: Unsecured Bid Bonds eliminate the need to bind your precious assets. Your financial flexibility remains unaffected- Customized Solutions: We are aware that each project is distinct. To satisfy your unique needs, we provide specialized Unsecured Bid Bond solutions- Competitive prices: We provide competitive prices so you may control project expenditures and concentrate on your main business activities"
  },
  {
    "title": "Performance Bonds",
    "content": "FinCorp Credit has entered into tripartite agreements with banks and insurance firms, reducing the collateral barrier, in response to the standard collateral requirements by banks to acquire performance guarantees. We recognize that in business, your success is frequently determined by your promises and the financial guarantees you can deliver. To fulfil your specific demands and promote business growth, we are pleased to offer our performance bond services.Why Choose Us:- Fast and Reliable Service: Time is often of the essence in the business world. We pride ourselves on our quick and efficient service, ensuring you can secure the performance bonds you need when needed- Customized Solutions: We are cognizant of the uniqueness of each business. For this reason, we collaborate closely with you to develop a performance bond solution that satisfies your particular needs. Whether you're a small contractor or a major organization, we've got you covered- Competitive prices: We offer some of the most competitive rates in the industry, helping you save money while obtaining the financial guarantees you require"
  },
  {
    "title": "Custom Bonds",
    "content": "FinCorp Credit through its partner banks and insurance companies offer custom bonds to importers to allow the release of cargo to avoid incurring storage and demurrage charges.Why Choose Us:- Innovation and Flexibility: We provide creative and adaptable solutions that change with your demands to stay up to date with the constantly shifting financial scene- Quick and Efficient Processing: We recognise that time is of the essence. Our streamlined procedures guarantee that you obtain your personalized bond promptly, freeing you up to concentrate on the things that are most important to you- Competitive Rates: Our goal is to deliver affordable solutions that minimize expenses and optimize your financial gains"
  },
  {
    "title": "Retention Bonds",
    "content": "Our retention bond services protect against non-completion or defective work in projects in the construction and service industries, providing a safety net for the performance of contracts. This ensures a portion of the contract value is held in reserve as security, giving all stakeholders peace of mind.Why Choose Us:- Reliability: The foundation of our company is trust. You can count on us to keep our end of the bargain and give you the tranquillity you deserve- Expertise in Your Corner: Our team of seasoned financial specialists brings a wealth of knowledge and experience to the table. We will walk you through each stage of the procedure because we are knowledgeable about the nuances of retention bonds- Streamlined Processes: We simplify complex financial procedures, ensuring that you can easily manage and understand your retention bonds. This efficiency allows you to concentrate on your core business activities"
  },
  {
    "title": "AGPO Framework Solutions",
    "content": "Welcome to Fincorp Credit, your go-to resource for understanding the complex world of AGPO (Access to Government Procurement Opportunities) Framework Solutions. At Fincorp, we understand the difficulties that businesses encounter in obtaining government contracts, and we're here to help you seize these possibilities with confidence.The service is sectioned into two:a) Where supply orders are backed by Letters of Credit (LCs):Procuring entities, through mutual agreement/contract, shall Issue local Letters of Credit (master LC) to special category suppliers. The LC terms shall be a replica of contract/Purchase Order terms. Subsequently, the supplier shall engage Fincorp Credit through its partner banks for the facilitation of working capital financing by way of back-to-back LC to the ultimate supplier. This overcomes performance and payment risk challenges.b) Where supply orders are backed by Local Purchase Orders (LPOs):Fincorp has entered into a Memorandum of Understanding (MOU) in partnership with reputable procuring entities for tailormade/customised LPO financing, on a case-to-case basis."
  },
  {
    "title": "Express LPO Financing",
    "content": "Whether you're a startup, SME, or a well-established enterprise, our Express LPO Financing service is your key to turning purchase orders into profits without the stress of liquidity issues. As a trade financing working capital facility, suppliers to respectable procurement entities have access to professionally designed financing with customized repayments to meet the cash conversion cycle.Benefits:- Rapid Access to Funds: Don't let funding constraints hold you back. You can quickly obtain the money you need with our Express LPO Financing to fulfil project deadlines and land important contracts- Competitive Rates: Our Express LPO Financing options have competitive rates, ensuring that you receive the funds you require at a reasonable cost- Financial Security: By utilizing our Express LPO Financing, you can be sure that your company has enough cash on hand to handle any emergent opportunities"
  },
  {
    "title": "Structured Trade & Supply Chain Financing",
    "content": "Structured trade financing is an alternative means of providing customised or tailor-made trade finance solutions outside the conventional financing approach. The focus shifts to the underlying cash flows and the structures agreed upon by FinCorp Credit and trading partners. FinCorp Credit experts in structured trade financing negotiate the best trading terms for their customers with their counterparts, locally, regionally and globally.Benefits:Enhanced Cash Flow:Optimize your cash flow by unlocking the capital tied up in your supply chain. This means more liquidity to seize new opportunities, expand your business, or manage day-to-day operations more efficiently.Risk Mitigation:International trade comes with inherent risks. Our financing solutions incorporate risk mitigation strategies to protect your investments and assets. We ensure that you have the financial safety net you need to navigate unpredictable global markets.Global Market Access:Break down international barriers and expand your reach. Our solutions provide access to global markets, allowing you to explore new trade opportunities and diversify your business's revenue streams."
  },
  {
    "title": "Invoice/Certificate Discounting",
    "content": "This product is for FinCorp's Credit customers in the supplies/construction business who intend to unlock working capital after invoicing. Our Invoice and Certificate Discounting services cover a wide range of options, including:Invoice Discounting: Convert your outstanding bills into cash to meet your current financial demands. We provide a quick and simple approach to make sure you have the money you need.Certificate Discounting: Convert your certificates and contracts into liquid assets by monetizing them. Businesses operating in diverse industries can particularly benefit from this solution.Partial Discounting: Choose to discount only a portion of your bills or certificates, preserving financial flexibility while successfully managing your cash flow.Benefits:- Working Capital Efficiency: Maintaining a strong working capital position is critical for every organization. Unlocking the funds locked up in accounts receivable through invoice and certificate discounting can help you maximize your working capital. You can then use this money to finance strategic projects like growth or inventory- Increased Flexibility with Money: Having the ability to obtain money when you need it provides a degree of financial flexibility that can help. With the help of our discounting services, you may take advantage of time-sensitive opportunities, grab discounts, and react quickly to changes in the market- No registration of debt: Invoice Discounting is not recorded as a debt but rather as the sale of a receivable, and hence does not interfere with other credit arrangements"
  },
  {
    "title": "Cheque Discounting",
    "content": "Get Your Cash Within 30 minutesCheque discounting is a financial service offered by Fincorp Credit Limited that allows businesses to access funds from their post-dated cheques before they are cleared by the bank. Do you have cheques drawn from reputable organizations and need cash, come to us for our cheque discounting solution that will enable you access cash for your business requirements while you wait for your cheque(s) to clear."
  },
  {
    "title": "Loan Eligibility & Requirements",
    "content": "Fincorp Credit offers secured loans to salaried individuals, starting from KES 100,000 up to KES 25 million. While mshahara loans are not currently available, salaried applicants still have access to suitable financing solutions. Self-employed clients are also eligible through the Jenga Biz Loan, which offers flexible repayment plans of up to three years. Applicants on probation can still qualify, though loan terms will align with the probationary period. Required documentation includes a national ID, KRA PIN certificate, a copy of the vehicle logbook, and the latest six months of bank and M-Pesa statements. Salaried clients must also present employment-related documents, while business clients are required to provide a valid business license and registration. Fincorp does check CRB (Credit Reference Bureau) records, but these do not automatically disqualify a client. If you have an existing loan with another institution, Fincorp can settle it and top up your new loan. There’s no minimum employment duration required, making access more inclusive."
  },
  {
    "title": "Loan Terms & Conditions",
    "content": "Interest rates at Fincorp Credit range from 3.5% to 10%, depending on the chosen loan term. The loan application process is efficient, typically completed within six hours. Repayment periods range from one month to three years. All fees and charges are transparently disclosed to clients to ensure clarity. Early repayments are encouraged and attract no penalties. In the event of a missed payment, clients receive timely reminders to avoid defaults. While payment holidays aren't offered, Fincorp provides restructuring options to help clients manage financial pressure without stress."
  },
  {
    "title": "Application Process",
    "content": "Currently, loan applications must be initiated in person, although clients are fully guided by a dedicated loan officer throughout the process. Once an application is submitted, the loan officer will reach out with the next steps. Clients are notified of approval via email or directly by the officer. Status tracking is facilitated through regular follow-ups with your assigned officer. A guarantor is not typically required unless dealing with complex files. Multiple secured loans are allowed, with a maximum combined limit of KES 25 million, based on the value of the provided security."
  },
  {
    "title": "Loan Amounts & Limits",
    "content": "Loan amounts range from a minimum of KES 100,000 to a maximum of KES 25 million. The amount a client qualifies for is determined by the type and value of the security provided, along with cash flow history over the past six months. While salary is a consideration for salaried individuals, the primary focus is on assets and financial behavior. Clients with good repayment records may qualify for loan increases."
  },
  {
    "title": "Practical Concerns",
    "content": "Fincorp Credit offices are located at Gallant Mall, 8th Floor, Westlands; Ecobank Towers, 11th Floor, Nairobi CBD; and Capital Centre, 2nd Floor, Kitengela. Operating hours are Monday to Friday from 8:00 AM to 5:00 PM, and Saturdays from 9:00 AM to 1:00 PM. Disbursement is fast—within six hours of approval—and loans can be issued even on Saturdays. Mobile money platforms like M-Pesa and Airtel Money are integrated for convenience. For data protection and security, applicants are required to collect their loans in person."
  },
  {
    "title": "Emergency & Support",
    "content": "If a client loses their job during the repayment period, they are encouraged to contact their relationship officer immediately for guidance. All payment-related concerns can also be addressed through this officer. Clients experiencing financial hardship can negotiate new payment terms to maintain loan performance without strain. Fincorp’s support structure ensures clients always have someone to turn to during difficult times."
  },
  {
    "title": "Product Information",
    "content": "In addition to loans for salaried individuals, Fincorp Credit offers a wide variety of financial products, including business loans secured with a logbook or title deed, emergency loans, and specialized trade finance solutions. The six-hour turnaround time makes Fincorp a dependable partner for urgent financial needs. Relationship officers and financial consultants are available to provide expert financial advice and personalized consultancy."
  },
  {
    "title": "Security & Trust",
    "content": "Fincorp Credit is certified and licensed by the Central Bank of Kenya, reinforcing its credibility and legal compliance as a trusted financial institution. All client data is protected under a strict data protection agreement. Personal and employment information is handled with confidentiality. Even after loan repayment, client data is retained securely with the expectation of continued business engagement."
  },
  {
    "title": "Comparison & Value",
    "content": "Fincorp stands out with a quick six-hour turnaround time, transparent processing, favorable interest rates, and flexible repayment terms. What sets the company apart is its highly experienced loan officers, committed to offering top-notch service and ensuring timely project execution for clients. Testimonials from satisfied customers are available on Fincorp’s social media platforms, offering real-world proof of the institution's reliability. With over five years of experience since its founding in 2020, Fincorp Credit continues to deliver on its mission to be Kenya’s most responsive and client-centered financing partner."
  }
]
